[Killed] ObjectLiteral
main/components/Courses/InstructorCoursesTable.jsx:57:5
       header: "id",
       accessorKey: "id", // accessor is the "key" in the data
     },
-    {
-      header: "Course Name",
-      id: "courseName",
-      cell: ({ cell }) => {
-        return (
-          <OverlayTrigger
-            placement="right"
-            overlay={
-              <Tooltip id={`tooltip-coursename-${cell.row.index}`}>
-                View course details
-              </Tooltip>
-            }
-          >
-            <Link
-              to={`/instructor/courses/${cell.row.original.id}`}
-              data-testid={`CoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
-            >
-              {cell.row.original.courseName}
-            </Link>
-          </OverlayTrigger>
-        );
-      },
-    },
+    {},
     {
       header: "Term",
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:71:19
             }
           >
             <Link
-              to={`/instructor/courses/${cell.row.original.id}`}
+              to={``}
               data-testid={`CoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
             >
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: expect(element).toHaveAttribute("href", "/instructor/courses/1") // element.getAttribute("href") === "/instructor/courses/1"

Expected the element to have attribute:
  href="/instructor/courses/1"
Received:
  href="/"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:210:17
   const installCallback = (cell) => {
     sessionStorage.setItem("redirect", location.pathname);
 
-    const url = `/api/courses/redirect?courseId=${cell.row.original.id}`;
+    const url = ``;
     if (storybook) {
       window.alert(`would have navigated to: ${url}`);
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Calls window.alert when the button is pressed on storybook
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "would have navigated to: /api/courses/redirect?courseId=3",

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:211:9
     sessionStorage.setItem("redirect", location.pathname);
 
     const url = `/api/courses/redirect?courseId=${cell.row.original.id}`;
-    if (storybook) {
+    if (true) {
       window.alert(`would have navigated to: ${url}`);
       return;
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Tests that when storybook is explictly false all still works as expected
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      "would have navigated to: /api/courses/redirect?courseId=3",
