[Killed] BlockStatement
main/components/Auth/SignInCardDisplay.jsx:10:31
 import loginProviderSchools from "main/utils/loginProviderSchools";
 
 export default function SignInCardDisplay({ alertMessage, onClick }) {
-  const microsoftIcon = () => {
-    return (
-      <span data-testid={"SignInPage-microsoftIcon"}>
-        <FaMicrosoft size={"10em"} role={"img"} />
-      </span>
-    );
-  };
+  const microsoftIcon = () => {};
 
   const { data: systemInfo } = useSystemInfo();
killedBy: SignInCardDisplay Tests Renders Microsoft card with activeDirectoryUrl present
statusReason: Unable to find an element by: [data-testid="SignInPage-microsoftIcon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="g-5 d-flex gap-5 justify-content-center align-items-center row row-cols-md-2 row-cols-1"
      data-testid="SignInPage-cardDisplay"

[Killed] StringLiteral
main/components/Auth/SignInCardDisplay.jsx:13:28
   const microsoftIcon = () => {
     return (
       <span data-testid={"SignInPage-microsoftIcon"}>
-        <FaMicrosoft size={"10em"} role={"img"} />
+        <FaMicrosoft size={""} role={"img"} />
       </span>
     );
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: expect(element).toHaveAttribute("height", "10em") // element.getAttribute("height") === "10em"

Expected the element to have attribute:
  height="10em"
Received:
  height="1em"

[Killed] BlockStatement
main/components/Auth/SignInCardDisplay.jsx:20:28
 
   const { data: systemInfo } = useSystemInfo();
 
-  const googleIcon = () => {
-    return (
-      <span data-testid={"SignInPage-googleIcon"}>
-        <FcGoogle size={"10em"} role={"img"} />
-      </span>
-    );
-  };
+  const googleIcon = () => {};
 
   return (
killedBy: SignInCardDisplay Tests Renders Google card with oauthLogin present
statusReason: Unable to find an element by: [data-testid="SignInPage-googleIcon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="g-5 d-flex gap-5 justify-content-center align-items-center row row-cols-md-2 row-cols-1"
      data-testid="SignInPage-cardDisplay"

[Killed] StringLiteral
main/components/Auth/SignInCardDisplay.jsx:22:26
 
   const googleIcon = () => {
     return (
-      <span data-testid={"SignInPage-googleIcon"}>
+      <span data-testid={""}>
         <FcGoogle size={"10em"} role={"img"} />
       </span>
killedBy: SignInCardDisplay Tests Renders Google card with oauthLogin present
statusReason: Unable to find an element by: [data-testid="SignInPage-googleIcon"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="g-5 d-flex gap-5 justify-content-center align-items-center row row-cols-md-2 row-cols-1"
      data-testid="SignInPage-cardDisplay"

[Killed] ConditionalExpression
main/components/Auth/SignInCardDisplay.jsx:30:8
 
   return (
     <>
-      {alertMessage && (
-        <Row className="p-3">
-          <Alert variant={"danger"}>{alertMessage}</Alert>
-        </Row>
-      )}
+      {false}
       <Row
         xs={1}
killedBy: SignInPage Tests Base environment test
statusReason: Unable to find an element with the text: Please sign in before accessing this page.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/Auth/SignInCardDisplay.jsx:30:8
 
   return (
     <>
-      {alertMessage && (
-        <Row className="p-3">
-          <Alert variant={"danger"}>{alertMessage}</Alert>
-        </Row>
-      )}
+      {true}
       <Row
         xs={1}
killedBy: SignInCardDisplay Tests Renders alert when alertMessage prop is provided
statusReason: Unable to find an element with the text: Test alert message. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="g-5 d-flex gap-5 justify-content-center align-items-center row row-cols-md-2 row-cols-1"
      da

[Killed] StringLiteral
main/components/Auth/SignInCardDisplay.jsx:32:27
     <>
       {alertMessage && (
         <Row className="p-3">
-          <Alert variant={"danger"}>{alertMessage}</Alert>
+          <Alert variant={""}>{alertMessage}</Alert>
         </Row>
       )}
killedBy: SignInPage Tests Base environment test
statusReason: expect(element).toHaveClass("alert-danger")

Expected the element to have class:
  alert-danger
Received:
  fade alert show

[Killed] ConditionalExpression
main/components/Auth/SignInCardDisplay.jsx:41:10
         className={"g-5 d-flex gap-5 justify-content-center align-items-center"}
         data-testid={"SignInPage-cardDisplay"}
       >
-        {systemInfo.oauthLogin && (
-          <SignInCard
-            Icon={googleIcon}
-            title={"Sign in with Google"}
-            description={
-              <>
-                If you have credentials with these schools, sign in with Google
-                <ul>
-                  {loginProviderSchools.google.map((school, index) => (
-                    <li key={index}>{school}</li>
-                  ))}
-                </ul>
-              </>
-            }
-            url={systemInfo.oauthLogin}
-            testid={"google"}
-            onClick={onClick}
-          />
-        )}
+        {false}
         {systemInfo.activeDirectoryUrl && (
           <SignInCard
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Unable to find an element with the text: Sign in with Google. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/Auth/SignInCardDisplay.jsx:41:10
         className={"g-5 d-flex gap-5 justify-content-center align-items-center"}
         data-testid={"SignInPage-cardDisplay"}
       >
-        {systemInfo.oauthLogin && (
-          <SignInCard
-            Icon={googleIcon}
-            title={"Sign in with Google"}
-            description={
-              <>
-                If you have credentials with these schools, sign in with Google
-                <ul>
-                  {loginProviderSchools.google.map((school, index) => (
-                    <li key={index}>{school}</li>
-                  ))}
-                </ul>
-              </>
-            }
-            url={systemInfo.oauthLogin}
-            testid={"google"}
-            onClick={onClick}
-          />
-        )}
+        {true}
         {systemInfo.activeDirectoryUrl && (
           <SignInCard
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Unable to find an element with the text: Sign in with Google. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/Auth/SignInCardDisplay.jsx:60:10
             onClick={onClick}
           />
         )}
-        {systemInfo.activeDirectoryUrl && (
-          <SignInCard
-            Icon={microsoftIcon}
-            title={"Sign in with Microsoft"}
-            description={
-              <>
-                If you have credentials with these schools, sign in with
-                Microsoft
-                <ul>
-                  {loginProviderSchools.microsoft.map((school, index) => (
-                    <li key={index}>{school}</li>
-                  ))}
-                </ul>
-              </>
-            }
-            url={systemInfo.activeDirectoryUrl}
-            testid={"microsoft"}
-            onClick={onClick}
-          />
-        )}
+        {true}
       </Row>
     </>
killedBy: SignInPage Tests Renders Active Directory card with activeDirectoryUrl present
statusReason: Unable to find an element with the text: Sign in with Microsoft. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/components/Auth/SignInCardDisplay.jsx:60:10
             onClick={onClick}
           />
         )}
-        {systemInfo.activeDirectoryUrl && (
-          <SignInCard
-            Icon={microsoftIcon}
-            title={"Sign in with Microsoft"}
-            description={
-              <>
-                If you have credentials with these schools, sign in with
-                Microsoft
-                <ul>
-                  {loginProviderSchools.microsoft.map((school, index) => (
-                    <li key={index}>{school}</li>
-                  ))}
-                </ul>
-              </>
-            }
-            url={systemInfo.activeDirectoryUrl}
-            testid={"microsoft"}
-            onClick={onClick}
-          />
-        )}
+        {systemInfo.activeDirectoryUrl || <SignInCard Icon={microsoftIcon} title={"Sign in with Microsoft"} description={<>
+                If you have credentials with these schools, sign in with
+                Microsoft
+                <ul>
+                  {loginProviderSchools.microsoft.map((school, index) => <li key={index}>{school}</li>)}
+                </ul>
+              </>} url={systemInfo.activeDirectoryUrl} testid={"microsoft"} onClick={onClick} />}
       </Row>
     </>
killedBy: SignInPage Tests Renders Google card with oauthLogin present
statusReason: Found multiple elements with the role "img"

Here are the matching elements:

Ignored nodes: comments, script, style
<svg
  enable-background="new 0 0 48 48"
  fill="currentColor"
