[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:30:42
   };
   // Stryker restore all
 
-  function cellToAxiosParamsDelete(cell) {
-    return {
-      // Stryker disable next-line StringLiteral
-      url: "/api/coursestaff/delete",
-      method: "DELETE",
-      params: {
-        id: cell.row.original.id,
-        courseId: courseId,
-      },
-    };
-  }
+  function cellToAxiosParamsDelete(cell) {}
 
   // Stryker disable all : hard to test for query caching
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/CourseStaff/CourseStaffTable.jsx:35:15
       // Stryker disable next-line StringLiteral
       url: "/api/coursestaff/delete",
       method: "DELETE",
-      params: {
-        id: cell.row.original.id,
-        courseId: courseId,
-      },
+      params: {},
     };
   }
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: expected {} to deeply equal { id: 1 }

[Killed] BlockStatement
main/components/CourseStaff/CourseStaffTable.jsx:82:38
     setDeleteStaff(cell.row.original.id);
   };
 
-  const submitDeleteForm = (data) => {
-    deleteMutation.mutate({
-      row: {
-        original: {
-          id: deleteStaff,
-        },
-      },
-      ...data,
-    });
-  };
+  const submitDeleteForm = (data) => {};
 
   const editMutation = useBackendMutation(
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/CourseStaff/CourseStaffTable.jsx:84:12
 
   const submitDeleteForm = (data) => {
     deleteMutation.mutate({
-      row: {
-        original: {
-          id: deleteStaff,
-        },
-      },
+      row: {},
       ...data,
     });
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/CourseStaff/CourseStaffTable.jsx:85:19
   const submitDeleteForm = (data) => {
     deleteMutation.mutate({
       row: {
-        original: {
-          id: deleteStaff,
-        },
+        original: {},
       },
       ...data,
killedBy: CourseStaffTable tests Delete button calls delete callback
statusReason: expected { id: undefined, courseId: undefined } to deeply equal { id: 1 }

[Killed] StringLiteral
main/components/CourseStaff/CourseStaffTable.jsx:147:11
         break;
       case "INVITED":
         set_message =
-          "Staff member has generated an invite, but has not yet accepted or declined the invitation.";
+          "";
         break;
       case "OWNER":
killedBy: CourseStaffTable tests tooltips for INVITED status
statusReason: Unable to find an element with the text: Staff member has generated an invite, but has not yet accepted or declined the invitation.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped tab
