[Survived] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:186:38
                 // Stryker disable next-line ObjectLiteral,StringLiteral: layout-only styling
                 <span
                   className="d-inline-block"
-                  style={{ position: "relative" }}
+                  style={{ position: "" }}
                 >
                   <Link
