[Killed] ObjectLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:34:5
   const { data: rosterStudents } = useBackend(
     [`/api/rosterstudents/course/${courseId}`],
     // Stryker disable next-line StringLiteral : GET and empty string are equivalent
-    { method: "GET", url: `/api/rosterstudents/course/${courseId}` },
+    {},
     [],
     true,
killedBy: EnrollmentTabComponent Tests Table Renders
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-RosterStudentTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:54:10
   };
 
   const objectToAxiosParamsPost = (student) => ({
-    url: `/api/rosterstudents/post`,
+    url: ``,
     method: "POST",
     params: {
killedBy: EnrollmentTabComponent Tests RosterStudentForm submit works and clears search filter
statusReason: expected "spy" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:92:13
       onError: (error) => {
         if (error.response.status !== 409) {
           toast.error(
-            `Error uploading CSV: ${JSON.stringify(error.response.data, null, 2)}`,
+            ``,
           );
         } else {
killedBy: EnrollmentTabComponent Tests CsvForm error returns correctly
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Error uploading CSV: {

[Killed] StringLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:167:28
           <div className="d-flex align-items-center gap-2">
             <Button
               onClick={() => setCsvModal(true)}
-              data-testid={`${testIdPrefix}-csv-button`}
+              data-testid={``}
               className="w-100"
             >
killedBy: EnrollmentTabComponent Tests Successfully makes a call to the backend on submit and clears search filter
statusReason: Unable to find an element by: [data-testid="InstructorCourseShowPage-csv-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      data-testid="InstructorCourseShowPage-EnrollmentTabComponent"
    >

[Killed] ObjectLiteral
main/components/TabComponent/EnrollmentTabComponent.jsx:195:28
                     aria-label="CSV upload help"
                     data-testid={`${testIdPrefix}-csv-info-link`}
                     className="d-flex align-items-center text-decoration-none text-primary"
-                    style={{ cursor: "pointer", fontSize: "1.4rem" }}
+                    style={{}}
                   >
                     ℹ️
killedBy: EnrollmentTabComponent Tests CSV info icon renders with tooltip and correct styles
statusReason: expect(element).toHaveStyle()

- Expected

- cursor: pointer;

[Killed] ConditionalExpression
main/components/TabComponent/EnrollmentTabComponent.jsx:253:26
                 student.githubLogin?.toLowerCase().includes(searchTermLower)
               ) {
                 return true;
-              } else if (fullName.toLowerCase().includes(searchTermLower)) {
+              } else if (true) {
                 return true;
               }
killedBy: EnrollmentTabComponent Tests Search filter works correctly First Name, Email
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Emma
Received:
  Alice
