[Killed] StringLiteral
main/pages/Help/HelpCsvPage.jsx:208:31
                 You can upload teams using a simple CSV with the following
                 format:
               </p>
-              <pre className={"csvExample"} data-testid="teamsCsvExample">
+              <pre className={""} data-testid="teamsCsvExample">
                 {csvFixtures.teamsByEmail}
               </pre>
killedBy: HelpCsvPage tests renders with separate Team Information section and examples
statusReason: expect(element).toHaveClass("csvExample")

Expected the element to have class:
  csvExample
Received:
