[Killed] BooleanLiteral
main/components/Courses/InstructorCoursesTable.jsx:19:28
   storybook = false,
   currentUser,
   testId = "InstructorCoursesTable",
-  enableInstructorUpdate = false,
+  enableInstructorUpdate = true,
   deleteCourseButton = false,
 }) {
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Tests instructor email is plain text for admin users when enableInstructorUpdate not selected
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button
  class="btn btn-link"
  data-testid="InstructorCoursesTable-cell-row-0-col-instructorEmail-button"
  style="padding: 0px; text-decoration: underline;"
  type="button"
>

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:24:28
 }) {
   const location = useLocation();
 
-  const canEdit = (row) => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return true;
-    }
-    if (
-      hasRole(currentUser, "ROLE_INSTRUCTOR") &&
-      row.original.instructorEmail === currentUser.root.user.email
-    ) {
-      return true;
-    }
-
-    return false;
-  };
+  const canEdit = (row) => {};
 
   const canDelete = (row) => {
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:25:9
   const location = useLocation();
 
   const canEdit = (row) => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
+    if (false) {
       return true;
     }
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for admin user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:25:45
   const location = useLocation();
 
   const canEdit = (row) => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return true;
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
     if (
       hasRole(currentUser, "ROLE_INSTRUCTOR") &&
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for admin user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:38:30
     return false;
   };
 
-  const canDelete = (row) => {
-    if (
-      hasRole(currentUser, "ROLE_ADMIN") &&
-      row.original.numStudents === 0 &&
-      row.original.numStaff === 0
-    ) {
-      return true;
-    }
-
-    return false;
-  };
+  const canDelete = (row) => {};
 
   const [showModal, setShowModal] = useState(false);
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for admin user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] LogicalOperator
main/components/Courses/InstructorCoursesTable.jsx:40:7
 
   const canDelete = (row) => {
     if (
-      hasRole(currentUser, "ROLE_ADMIN") &&
-      row.original.numStudents === 0 &&
-      row.original.numStaff === 0
+      hasRole(currentUser, "ROLE_ADMIN") && row.original.numStudents === 0 || row.original.numStaff === 0
     ) {
       return true;
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Instructor user cannot delete courses
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-delete-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:40:7
 
   const canDelete = (row) => {
     if (
-      hasRole(currentUser, "ROLE_ADMIN") &&
-      row.original.numStudents === 0 &&
-      row.original.numStaff === 0
+      true
     ) {
       return true;
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Instructor user cannot delete courses
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-delete-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] EqualityOperator
main/components/Courses/InstructorCoursesTable.jsx:41:7
   const canDelete = (row) => {
     if (
       hasRole(currentUser, "ROLE_ADMIN") &&
-      row.original.numStudents === 0 &&
+      row.original.numStudents !== 0 &&
       row.original.numStaff === 0
     ) {
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Admin user cannot delete courses with students or staff
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-1-col-delete-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:41:7
   const canDelete = (row) => {
     if (
       hasRole(currentUser, "ROLE_ADMIN") &&
-      row.original.numStudents === 0 &&
+      true &&
       row.original.numStaff === 0
     ) {
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Admin user cannot delete courses with students or staff
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-1-col-delete-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:42:7
     if (
       hasRole(currentUser, "ROLE_ADMIN") &&
       row.original.numStudents === 0 &&
-      row.original.numStaff === 0
+      true
     ) {
       return true;
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Admin user cannot delete courses with students or staff
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-delete-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] EqualityOperator
main/components/Courses/InstructorCoursesTable.jsx:42:7
     if (
       hasRole(currentUser, "ROLE_ADMIN") &&
       row.original.numStudents === 0 &&
-      row.original.numStaff === 0
+      row.original.numStaff !== 0
     ) {
       return true;
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Admin user cannot delete courses with students or staff
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-delete-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:43:7
       hasRole(currentUser, "ROLE_ADMIN") &&
       row.original.numStudents === 0 &&
       row.original.numStaff === 0
-    ) {
-      return true;
-    }
+    ) {}
 
     return false;
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for admin user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] BooleanLiteral
main/components/Courses/InstructorCoursesTable.jsx:54:70
   const [selectedCourse, setSelectedCourse] = useState(null);
   const [showCourseEditModal, setShowCourseEditModal] = useState(false);
   const [selectedCourseForEdit, setSelectedCourseForEdit] = useState(null);
-  const [showCourseDeleteModal, setShowCourseDeleteModal] = useState(false);
+  const [showCourseDeleteModal, setShowCourseDeleteModal] = useState(true);
   const [selectedCourseForDelete, setSelectedCourseForDelete] = useState(null);
 
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:67:51
     setSelectedCourseForEdit(null);
   };
 
-  const handleShowCourseDeleteModal = (course) => {
-    setSelectedCourseForDelete(course);
-    setShowCourseDeleteModal(true);
-  };
+  const handleShowCourseDeleteModal = (course) => {};
 
   const handleCloseCourseDeleteModal = () => {
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Delete course modal opens and closes properly
statusReason: Unable to find an element by: [data-testid="CourseModal-delete"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] BooleanLiteral
main/components/Courses/InstructorCoursesTable.jsx:69:30
 
   const handleShowCourseDeleteModal = (course) => {
     setSelectedCourseForDelete(course);
-    setShowCourseDeleteModal(true);
+    setShowCourseDeleteModal(false);
   };
 
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Delete course modal opens and closes properly
statusReason: Unable to find an element by: [data-testid="CourseModal-delete"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:72:46
     setShowCourseDeleteModal(true);
   };
 
-  const handleCloseCourseDeleteModal = () => {
-    setShowCourseDeleteModal(false);
-    setSelectedCourseForDelete(null);
-  };
+  const handleCloseCourseDeleteModal = () => {};
 
   const columns = [
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Delete course modal opens and closes properly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="CourseModal-delete"
>
  <div
    class="modal-content"

[Killed] BooleanLiteral
main/components/Courses/InstructorCoursesTable.jsx:73:30
   };
 
   const handleCloseCourseDeleteModal = () => {
-    setShowCourseDeleteModal(false);
+    setShowCourseDeleteModal(true);
     setSelectedCourseForDelete(null);
   };
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Delete course modal opens and closes properly
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="modal-dialog modal-dialog-centered"
  data-testid="CourseModal-delete"
>
  <div
    class="modal-content"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:84:11
     },
     {
       header: "Course Name",
-      id: "courseName",
+      id: "",
       cell: ({ cell }) => {
         return (
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Instructor user cannot delete courses
statusReason: Columns require an id when using a non-string header

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:85:27
     {
       header: "Course Name",
       id: "courseName",
-      cell: ({ cell }) => {
-        return (
-          <OverlayTrigger
-            placement="right"
-            overlay={
-              <Tooltip id={`tooltip-coursename-${cell.row.index}`}>
-                View course details
-              </Tooltip>
-            }
-          >
-            <Link
-              to={`/instructor/courses/${cell.row.original.id}`}
-              data-testid={`CoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-link`}
-            >
-              {cell.row.original.courseName}
-            </Link>
-          </OverlayTrigger>
-        );
-      },
+      cell: ({ cell }) => {},
     },
     {
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  CMPSC 156
Received:

[Killed] ObjectLiteral
main/components/Courses/InstructorCoursesTable.jsx:109:5
       header: "Term",
       accessorKey: "term",
     },
-    {
-      header: "School",
-      accessorKey: "school",
-    },
+    {},
     {
       header: "Edit",
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Instructor user cannot delete courses
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:111:20
     },
     {
       header: "School",
-      accessorKey: "school",
+      accessorKey: "",
     },
     {
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Instructor user cannot delete courses
statusReason: Columns require an id when using a non-string header

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:147:7
       accessorKey: "numStaff",
     },
   ];
-  if (deleteCourseButton) {
+  if (false) {
     columns.push({
       header: "Delete",
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Instructor user cannot delete courses
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-delete-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:147:7
       accessorKey: "numStaff",
     },
   ];
-  if (deleteCourseButton) {
+  if (true) {
     columns.push({
       header: "Delete",
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests InstructorCoursesTable has no delete column by default
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <th
  colspan="1"
  data-testid="InstructorCoursesTable-header-delete"
>
  <div
    data-testid="InstructorCoursesTable-header-delete-sort-header"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:149:15
   ];
   if (deleteCourseButton) {
     columns.push({
-      header: "Delete",
+      header: "",
       id: "delete",
       cell: ({ cell }) => {
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has Delete column header on CoursesIndexPage
statusReason: Unable to find an accessible element with the role "columnheader" and name `/Delete/i`

Here are the accessible roles:

  navigation:

  Name "":
  <nav

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:153:30
       id: "delete",
       cell: ({ cell }) => {
         const canDeleteCourse = canDelete(cell.row);
-        if (canDeleteCourse) {
-          return (
-            <Button
-              variant="danger"
-              size="sm"
-              onClick={() => handleShowCourseDeleteModal(cell.row.original)}
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-delete-button`}
-            >
-              Delete
-            </Button>
-          );
-        } else {
+        if (canDeleteCourse) {} else {
           return (
             <OverlayTrigger
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for admin user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:153:13
       id: "delete",
       cell: ({ cell }) => {
         const canDeleteCourse = canDelete(cell.row);
-        if (canDeleteCourse) {
+        if (false) {
           return (
             <Button
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for admin user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] ArrowFunction
main/components/Courses/InstructorCoursesTable.jsx:158:24
             <Button
               variant="danger"
               size="sm"
-              onClick={() => handleShowCourseDeleteModal(cell.row.original)}
+              onClick={() => undefined}
               data-testid={`${testId}-cell-row-${cell.row.index}-col-delete-button`}
             >
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Delete course modal opens and closes properly
statusReason: Unable to find an element by: [data-testid="CourseModal-delete"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:164:16
               Delete
             </Button>
           );
-        } else {
-          return (
-            <OverlayTrigger
-              placement="top"
-              overlay={
-                <Tooltip id="tooltip-disabled">
-                  Cannot delete a course with active students or staff
-                </Tooltip>
-              }
-            >
-              <span className="d-inline-block">
-                <Button
-                  variant="light"
-                  size="sm"
-                  disabled
-                  style={{ pointerEvents: "none" }}
-                  data-testid={`${testId}-cell-row-${cell.row.index}-col-delete-no-permission`}
-                >
-                  Delete
-                </Button>
-              </span>
-            </OverlayTrigger>
-          );
-        }
+        } else {}
       },
     });
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Instructor user cannot delete courses
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-delete-no-permission"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] ObjectLiteral
main/components/Courses/InstructorCoursesTable.jsx:179:26
                   variant="light"
                   size="sm"
                   disabled
-                  style={{ pointerEvents: "none" }}
+                  style={{}}
                   data-testid={`${testId}-cell-row-${cell.row.index}-col-delete-no-permission`}
                 >
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Tooltip has correct style
statusReason: expect(element).toHaveStyle()

- Expected

- pointerEvents: none;

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:191:47
       },
     });
   }
-  const cellToAxiosParamsEdit = (formData) => {
-    return {
-      url: `/api/courses/updateInstructor`,
-      method: "PUT",
-      params: {
-        courseId: formData.courseId,
-        instructorEmail: formData.instructorEmail,
-      },
-    };
-  };
+  const cellToAxiosParamsEdit = (formData) => {};
 
   const cellToAxiosParamsCourseEdit = (formData) => {
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful API call and dismisses modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:194:15
   const cellToAxiosParamsEdit = (formData) => {
     return {
       url: `/api/courses/updateInstructor`,
-      method: "PUT",
+      method: "",
       params: {
         courseId: formData.courseId,
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful API call and dismisses modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:215:55
     };
   };
 
-  const cellToAxiosParamsCourseDelete = (formData) => {
-    return {
-      url: `/api/courses`,
-      method: "DELETE",
-      params: {
-        courseId: formData.courseId,
-      },
-    };
-  };
+  const cellToAxiosParamsCourseDelete = (formData) => {};
 
   const onInstructorUpdateSuccess = () => {
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful course delete API call and shows success toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/Courses/InstructorCoursesTable.jsx:216:12
   };
 
   const cellToAxiosParamsCourseDelete = (formData) => {
-    return {
-      url: `/api/courses`,
-      method: "DELETE",
-      params: {
-        courseId: formData.courseId,
-      },
-    };
+    return {};
   };
 
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful course delete API call and shows success toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:218:15
   const cellToAxiosParamsCourseDelete = (formData) => {
     return {
       url: `/api/courses`,
-      method: "DELETE",
+      method: "",
       params: {
         courseId: formData.courseId,
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful course delete API call and shows success toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] ObjectLiteral
main/components/Courses/InstructorCoursesTable.jsx:219:15
     return {
       url: `/api/courses`,
       method: "DELETE",
-      params: {
-        courseId: formData.courseId,
-      },
+      params: {},
     };
   };
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful course delete API call and shows success toast
statusReason: expected {} to deeply equal { courseId: 3 }

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:232:9
   const onInstructorUpdateError = (error) => {
     if (error.response.data.message)
       toast(
-        `Was not able to update instructor:\n${error.response.data.message}`,
+        ``,
       );
     else toast(`Was not able to update instructor:\n${error.message}`);
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Shows alert when API call fails with 400 error plus message
statusReason: expected "spy" to be called with arguments: [ Array(1) ]

Received: 

  1st spy call:

  [
-   "Was not able to update instructor:

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:248:39
     else toast(`Was not able to update course:\n${error.message}`);
   };
 
-  const onCourseDeleteSuccess = () => {
-    handleCloseCourseDeleteModal();
-    toast("Course deleted successfully");
-  };
+  const onCourseDeleteSuccess = () => {};
 
   const editMutation = useBackendMutation(
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful course delete API call and shows success toast
statusReason: expected "spy" to be called with arguments: [ 'Course deleted successfully' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:250:11
 
   const onCourseDeleteSuccess = () => {
     handleCloseCourseDeleteModal();
-    toast("Course deleted successfully");
+    toast("");
   };
 
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful course delete API call and shows success toast
statusReason: expected "spy" to be called with arguments: [ 'Course deleted successfully' ]

Received: 

  1st spy call:

  [
-   "Course deleted successfully",

[Killed] ObjectLiteral
main/components/Courses/InstructorCoursesTable.jsx:255:5
 
   const editMutation = useBackendMutation(
     cellToAxiosParamsEdit,
-    {
-      onSuccess: onInstructorUpdateSuccess,
-      onError: onInstructorUpdateError,
-    },
+    {},
     ["/api/courses/allForAdmins", "/api/courses/allForInstructors"],
   );
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful API call and dismisses modal
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  aria-modal="true"
  class="fade modal show"
  role="dialog"
  style="display: block; padding-right: 0px;"
  tabindex="-1"

[Killed] ArrayDeclaration
main/components/Courses/InstructorCoursesTable.jsx:259:5
       onSuccess: onInstructorUpdateSuccess,
       onError: onInstructorUpdateError,
     },
-    ["/api/courses/allForAdmins", "/api/courses/allForInstructors"],
+    [],
   );
 
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Instructor update mutation uses correct cache keys for invalidation
statusReason: expected "invalidateQueries" to be called 2 times, but got 0 times

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:259:35
       onSuccess: onInstructorUpdateSuccess,
       onError: onInstructorUpdateError,
     },
-    ["/api/courses/allForAdmins", "/api/courses/allForInstructors"],
+    ["/api/courses/allForAdmins", ""],
   );
 
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Instructor update mutation uses correct cache keys for invalidation
statusReason: expected "invalidateQueries" to be called with arguments: [ Array(1) ]

Received: 

  1st invalidateQueries call:

  [
    {

[Killed] ObjectLiteral
main/components/Courses/InstructorCoursesTable.jsx:264:5
 
   const courseEditMutation = useBackendMutation(
     cellToAxiosParamsCourseEdit,
-    {
-      onSuccess: onCourseUpdateSuccess,
-      onError: onCourseUpdateError,
-    },
+    {},
     ["/api/courses/allForAdmins", "/api/courses/allForInstructors"],
   );
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful course update API call and shows success toast
statusReason: expected "spy" to be called with arguments: [ 'Course updated successfully' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:268:6
       onSuccess: onCourseUpdateSuccess,
       onError: onCourseUpdateError,
     },
-    ["/api/courses/allForAdmins", "/api/courses/allForInstructors"],
+    ["", "/api/courses/allForInstructors"],
   );
 
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Course update mutation uses correct cache keys for invalidation
statusReason: expected "invalidateQueries" to be called with arguments: [ Array(1) ]

Received: 

  1st invalidateQueries call:

  [
    {
