[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:294:50
     editMutation.mutate(formData);
   };
 
-  const handleUpdateCourse = async (formData) => {
-    formData.courseId = selectedCourseForEdit.id;
-    courseEditMutation.mutate(formData);
-  };
+  const handleUpdateCourse = async (formData) => {};
 
   const handleDeleteCourse = async (formData) => {
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful course update API call and shows success toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:299:50
     courseEditMutation.mutate(formData);
   };
 
-  const handleDeleteCourse = async (formData) => {
-    formData.courseId = selectedCourseForDelete.id;
-    courseDeleteMutation.mutate(formData);
-  };
+  const handleDeleteCourse = async (formData) => {};
 
   const installCallback = (cell) => {
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Makes successful course delete API call and shows success toast
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body
    class="modal-open"
    data-rr-ui-modal-open=""

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:304:37
     courseDeleteMutation.mutate(formData);
   };
 
-  const installCallback = (cell) => {
-    sessionStorage.setItem("redirect", location.pathname);
-
-    const url = `/api/courses/redirect?courseId=${cell.row.original.id}`;
-    if (storybook) {
-      window.alert(`would have navigated to: ${url}`);
-      return;
-    }
-    window.location.href = url;
-  };
+  const installCallback = (cell) => {};
 
   const canInstall = (row) => {
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: expected "spy" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:305:28
   };
 
   const installCallback = (cell) => {
-    sessionStorage.setItem("redirect", location.pathname);
+    sessionStorage.setItem("", location.pathname);
 
     const url = `/api/courses/redirect?courseId=${cell.row.original.id}`;
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Tests that when storybook is explictly false all still works as expected
statusReason: expected null to be '/instructor/courses' // Object.is equality

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:308:9
     sessionStorage.setItem("redirect", location.pathname);
 
     const url = `/api/courses/redirect?courseId=${cell.row.original.id}`;
-    if (storybook) {
+    if (false) {
       window.alert(`would have navigated to: ${url}`);
       return;
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: expected "spy" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:308:20
     sessionStorage.setItem("redirect", location.pathname);
 
     const url = `/api/courses/redirect?courseId=${cell.row.original.id}`;
-    if (storybook) {
-      window.alert(`would have navigated to: ${url}`);
-      return;
-    }
+    if (storybook) {}
     window.location.href = url;
   };
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: expected "spy" to be called 1 times, but got 0 times

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:315:31
     window.location.href = url;
   };
 
-  const canInstall = (row) => {
-    if (row.original.orgName) {
-      return false;
-    }
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return true;
-    }
-    if (
-      hasRole(currentUser, "ROLE_INSTRUCTOR") &&
-      row.original.instructorEmail === currentUser.root.user.email
-    ) {
-      return true;
-    }
-
-    return false;
-  };
+  const canInstall = (row) => {};
 
   const renderTooltip = (cell) => {
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-orgName-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:316:9
   };
 
   const canInstall = (row) => {
-    if (row.original.orgName) {
+    if (false) {
       return false;
     }
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element with the text: ucsb-cs156-s25. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:316:9
   };
 
   const canInstall = (row) => {
-    if (row.original.orgName) {
+    if (true) {
       return false;
     }
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-orgName-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] BooleanLiteral
main/components/Courses/InstructorCoursesTable.jsx:317:14
 
   const canInstall = (row) => {
     if (row.original.orgName) {
-      return false;
+      return true;
     }
     if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element with the text: ucsb-cs156-s25. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:319:45
     if (row.original.orgName) {
       return false;
     }
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return true;
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
     if (
       hasRole(currentUser, "ROLE_INSTRUCTOR") &&
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for admin user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-orgName-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:323:7
       return true;
     }
     if (
-      hasRole(currentUser, "ROLE_INSTRUCTOR") &&
-      row.original.instructorEmail === currentUser.root.user.email
+      true
     ) {
       return true;
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-3-col-orgName-no-org"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:332:35
     return false;
   };
 
-  const renderTooltip = (cell) => {
-    let set_message;
-    const result = canInstall(cell.row);
-    if (result) {
-      set_message = `Click to install the GitHub app for ${cell.row.original.courseName}`;
-    } else {
-      set_message = `View organization associated with ${cell.row.original.courseName}.`;
-    }
-    return (
-      <Tooltip id={`tooltip-orgname-${cell.row.index}`}>{set_message}</Tooltip>
-    );
-  };
+  const renderTooltip = (cell) => {};
 
   const columnsWithInstall = [
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests expect the correct tooltip ID for the orgName tooltips
statusReason: Cannot read properties of undefined (reading 'props')

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:335:17
   const renderTooltip = (cell) => {
     let set_message;
     const result = canInstall(cell.row);
-    if (result) {
-      set_message = `Click to install the GitHub app for ${cell.row.original.courseName}`;
-    } else {
+    if (result) {} else {
       set_message = `View organization associated with ${cell.row.original.courseName}.`;
     }
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests the correct tooltip renders for orgName when a GitHub organization does NOT exist for the course
statusReason: Unable to find an element with the text: Click to install the GitHub app for CMPSC 156. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCou

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:335:9
   const renderTooltip = (cell) => {
     let set_message;
     const result = canInstall(cell.row);
-    if (result) {
+    if (true) {
       set_message = `Click to install the GitHub app for ${cell.row.original.courseName}`;
     } else {
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests the correct tooltip renders for orgName when a GitHub organization exists for the course
statusReason: Unable to find an element with the text: View organization associated with CPTS 489.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCours

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:336:21
     let set_message;
     const result = canInstall(cell.row);
     if (result) {
-      set_message = `Click to install the GitHub app for ${cell.row.original.courseName}`;
+      set_message = ``;
     } else {
       set_message = `View organization associated with ${cell.row.original.courseName}.`;
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests the correct tooltip renders for orgName when a GitHub organization does NOT exist for the course
statusReason: Unable to find an element with the text: Click to install the GitHub app for CMPSC 156. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCou

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:337:12
     const result = canInstall(cell.row);
     if (result) {
       set_message = `Click to install the GitHub app for ${cell.row.original.courseName}`;
-    } else {
-      set_message = `View organization associated with ${cell.row.original.courseName}.`;
-    }
+    } else {}
     return (
       <Tooltip id={`tooltip-orgname-${cell.row.index}`}>{set_message}</Tooltip>
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests the correct tooltip renders for orgName when a GitHub organization exists for the course
statusReason: Unable to find an element with the text: View organization associated with CPTS 489.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCours

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:338:21
     if (result) {
       set_message = `Click to install the GitHub app for ${cell.row.original.courseName}`;
     } else {
-      set_message = `View organization associated with ${cell.row.original.courseName}.`;
+      set_message = ``;
     }
     return (
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests the correct tooltip renders for orgName when a GitHub organization exists for the course
statusReason: Unable to find an element with the text: View organization associated with CPTS 489.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCours

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:352:13
       id: "orgName",
       cell: ({ cell }) => {
         const result = canInstall(cell.row);
-        if (result) {
+        if (false) {
           return (
             <OverlayTrigger placement="right" overlay={renderTooltip(cell)}>
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-orgName-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] BlockStatement
main/components/Courses/InstructorCoursesTable.jsx:352:21
       id: "orgName",
       cell: ({ cell }) => {
         const result = canInstall(cell.row);
-        if (result) {
-          return (
-            <OverlayTrigger placement="right" overlay={renderTooltip(cell)}>
-              <span>
-                <Button
-                  variant={"primary"}
-                  onClick={() => installCallback(cell)}
-                  data-testid={`${testId}-cell-row-${cell.row.index}-col-${cell.column.id}-button`}
-                >
-                  Install GitHub App
-                </Button>
-              </span>
-            </OverlayTrigger>
-          );
-        } else if (!cell.row.original.orgName) {
+        if (result) {} else if (!cell.row.original.orgName) {
           return (
             <span
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-2-col-orgName-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:366:20
               </span>
             </OverlayTrigger>
           );
-        } else if (!cell.row.original.orgName) {
+        } else if (true) {
           return (
             <span
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element with the text: ucsb-cs156-s25. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] BooleanLiteral
main/components/Courses/InstructorCoursesTable.jsx:366:20
               </span>
             </OverlayTrigger>
           );
-        } else if (!cell.row.original.orgName) {
+        } else if (cell.row.original.orgName) {
           return (
             <span
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Has the expected column headers and content for instructor user
statusReason: Unable to find an element with the text: ucsb-cs156-s25. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:405:27
               >
                 <span>
                   <a
-                    href={`https://github.com/organizations/${cell.row.original.orgName}/settings/installations/${cell.row.original.installationId}`}
+                    href={``}
                     target="_blank"
                     rel="noopener noreferrer"
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Tests for GitHub link
statusReason: expect(element).toHaveAttribute("href", "https://github.com/organizations/ucsb-cs156-s25/settings/installations/123456") // element.getAttribute("href") === "https://github.com/organizations/ucsb-cs156-s25/settings/installations/123456"

Expected the element to have attribute:
  href="https://github.com/organizations/ucsb-cs156-s25/settings/installations/123456"
Received:
  href=""

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:408:34
                     href={`https://github.com/organizations/${cell.row.original.orgName}/settings/installations/${cell.row.original.installationId}`}
                     target="_blank"
                     rel="noopener noreferrer"
-                    data-testid={`CoursesTable-cell-row-${cell.row.index}-col-${cell.column.id}-github-settings-link`}
+                    data-testid={``}
                   >
                     <GithubSettingIcon
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Tests for GitHub link
statusReason: Unable to find an element by: [data-testid="CoursesTable-cell-row-0-col-orgName-github-settings-link"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] ObjectLiteral
main/components/Courses/InstructorCoursesTable.jsx:422:5
         }
       },
     },
-    {
-      header: "Instructor",
-      accessorKey: "instructorEmail",
-      cell: ({ cell }) => {
-        const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
-        if (isAdmin && enableInstructorUpdate) {
-          return (
-            <Button
-              variant="link"
-              onClick={() => handleShowModal(cell.row.original)}
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-instructorEmail-button`}
-              style={{ padding: 0, textDecoration: "underline" }}
-            >
-              {cell.row.original.instructorEmail}
-            </Button>
-          );
-        } else {
-          return cell.row.original.instructorEmail;
-        }
-      },
-    },
+    {},
   ];
 
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Instructor user cannot delete courses
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:424:20
     },
     {
       header: "Instructor",
-      accessorKey: "instructorEmail",
+      accessorKey: "",
       cell: ({ cell }) => {
         const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Instructor user cannot delete courses
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Courses/InstructorCoursesTable.jsx:432:28
             <Button
               variant="link"
               onClick={() => handleShowModal(cell.row.original)}
-              data-testid={`${testId}-cell-row-${cell.row.index}-col-instructorEmail-button`}
+              data-testid={``}
               style={{ padding: 0, textDecoration: "underline" }}
             >
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Tests instructor email is clickable for admin users when enableInstructorUpdate selected
statusReason: Unable to find an element by: [data-testid="InstructorCoursesTable-cell-row-0-col-instructorEmail-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="InstructorCoursesTable"

[Killed] ObjectLiteral
main/components/Courses/InstructorCoursesTable.jsx:433:22
               variant="link"
               onClick={() => handleShowModal(cell.row.original)}
               data-testid={`${testId}-cell-row-${cell.row.index}-col-instructorEmail-button`}
-              style={{ padding: 0, textDecoration: "underline" }}
+              style={{}}
             >
               {cell.row.original.instructorEmail}
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Tests styling of instructor email button for admins
statusReason: expect(element).toHaveStyle()

- Expected

- padding: 0px;
- textDecoration: underline;
+ padding: 2px 6px 3px 6px;

[Killed] LogicalOperator
main/components/Courses/InstructorCoursesTable.jsx:482:12
         </Modal.Header>
 
         <Modal.Body>
-          {selectedCourseForDelete && (
-            <p>
-              Please confirm that you really want to delete course&nbsp;
-              <strong>{selectedCourseForDelete.courseName}</strong>. This action
-              cannot be undone.
-            </p>
-          )}
+          {selectedCourseForDelete || <p>
+              Please confirm that you really want to delete course&nbsp;
+              <strong>{selectedCourseForDelete.courseName}</strong>. This action
+              cannot be undone.
+            </p>}
         </Modal.Body>
 
killedBy: InstructorCoursesTable tests InstructorCoursesTable basic tests Instructor user cannot delete courses
statusReason: Cannot read properties of null (reading 'courseName')

[Killed] ConditionalExpression
main/components/Courses/InstructorCoursesTable.jsx:482:12
         </Modal.Header>
 
         <Modal.Body>
-          {selectedCourseForDelete && (
-            <p>
-              Please confirm that you really want to delete course&nbsp;
-              <strong>{selectedCourseForDelete.courseName}</strong>. This action
-              cannot be undone.
-            </p>
-          )}
+          {true}
         </Modal.Body>
 
killedBy: InstructorCoursesTable tests InstructorCoursesTable update instructor modal tests Delete course modal opens and closes properly
statusReason: Unable to find an element with the text: CMPSC 156, which matches selector 'strong'. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 1024px;"
>
